In [1]:
import pandas as pd
import numpy as np

In [3]:
arr=[0,1,2,3,4,5]
s1 = pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [6]:
order = ["a","b", "c", "d", "e", "f"]
s2 = pd.Series(arr, index=order)
s2

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [8]:
dict = {"a": 1, 
        "b": 2, 
        "c": 3, 
        "d": 4}
s3 = pd.Series(dict)
s3

a    1
b    2
c    3
d    4
dtype: int64

In [15]:
dates = pd.date_range("today", periods=6)
# dates
num_arr = np.random.randn(6,4)
# num_arr
columns = ["A", "B", "C", "D"]
df1 = pd.DataFrame(num_arr, index=dates, columns = columns)
df1

                                   A         B         C         D
2020-05-04 20:18:50.058026  1.542390 -0.045546  0.894570  1.531538
2020-05-05 20:18:50.058026  0.229133  1.278906 -2.728281 -0.988804
2020-05-06 20:18:50.058026  0.292807  1.373070 -1.308933 -0.027221
2020-05-07 20:18:50.058026 -1.253183  0.964706  2.360434 -1.276647
2020-05-08 20:18:50.058026 -1.636411  0.783800  1.011901 -0.545729
2020-05-09 20:18:50.058026 -1.012186 -1.066798 -0.575277 -0.593953

In [16]:
df1.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.306242  0.548023 -0.057598 -0.316803
std    1.202276  0.938518  1.836503  1.000233
min   -1.636411 -1.066798 -2.728281 -1.276647
25%   -1.192934  0.161791 -1.125519 -0.890091
50%   -0.391526  0.874253  0.159646 -0.569841
75%    0.276889  1.200356  0.982568 -0.156848
max    1.542390  1.373070  2.360434  1.531538

In [17]:
df1.T

,2020-05-04 20:18:50.058026,2020-05-05 20:18:50.058026,2020-05-06 20:18:50.058026,2020-05-07 20:18:50.058026,2020-05-08 20:18:50.058026,2020-05-09 20:18:50.058026
A,1.542390,0.229133,0.292807,-1.253183,-1.636411,-1.012186
B,-0.045546,1.278906,1.373070,0.964706,0.783800,-1.066798
C,0.894570,-2.728281,-1.308933,2.360434,1.011901,-0.575277
D,1.531538,-0.988804,-0.027221,-1.276647,-0.545729,-0.593953

In [19]:
df1.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [20]:
d = {'animal':['cat', 'dog','snake', 'turtle'],
     'age':[4,2,1,3], 
     'visits':[9,8,7,6],
     'priority':['yes','no','no','yes']}
labels = ['A', 'B', 'C', 'D']
df2 = pd.DataFrame(d, index=labels)
df2

   animal  age  visits priority
A     cat    4       9      yes
B     dog    2       8       no
C   snake    1       7       no
D  turtle    3       6      yes

In [21]:
df2.dtypes

animal      object
age          int64
visits       int64
priority    object
dtype: object

In [23]:
df2.head(2)

  animal  age  visits priority
A    cat    4       9      yes
B    dog    2       8       no

In [26]:
df2.tail(2)

   animal  age  visits priority
C   snake    1       7       no
D  turtle    3       6      yes

In [29]:
df2.columns

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [30]:
df2.sort_values(by="age")

   animal  age  visits priority
C   snake    1       7       no
B     dog    2       8       no
D  turtle    3       6      yes
A     cat    4       9      yes